Revit 2026 API

# ConnectionValidationInfo Methods

---

The ConnectionValidationInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetWarning | Access specific warning number of warnings generated by reload. |
|  | IsValidWarningIndex | Validate warning index. |
|  | ManyWarnings | Returns number of warnings generated by reload. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ConnectionValidationInfo Class

Autodesk.Revit.DB Namespace